# Pandas
Pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,
built on top of the Python programming language.

In [1]:
import pandas as pd

# Series
Series is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.). The axis labels are collectively referred to as the index.

In [14]:
fruits = pd.Series(["apple", "pear", "orange", "melon", "kiwi"])
fruits[0]

'apple'

In [4]:
numbers = pd.Series([5, 6, 3])
numbers * 2 + 1

0    5
1    6
2    3
dtype: int64

In [15]:
numbers >= 5

0     True
1     True
2    False
dtype: bool

In [16]:
numbers[numbers >=5]

0    5
1    6
dtype: int64

# DataFrame
DataFrame is a 2-dimensionaal labeled data structure with columns of potentially different types. You can think of it like a spreadsheet, or a dict of Series objects. It is generally the most commonly used pandas object.

In [21]:
data = {
    "Name": ["Anders", "Tomas", "Mario"],
    "Age": [42, 46, 36]
}

df = pd.DataFrame(data)
df

     Name  Age
0  Anders   42
1   Tomas   46
2   Mario   36

In [28]:
data = [
    {"Name": "Anders", "Age": 42},
    {"Name": "Tomas", "Age": 46},
    {"Name": "Mario", "Age": 36}
]
df = pd.DataFrame(data)
df

     Name  Age
0  Anders   42
1   Tomas   46
2   Mario   36

In [34]:
df["Age"] = df["Age"] + 1
df

     Name  Age
0  Anders   47
1   Tomas   51
2   Mario   41

In [36]:
df[df["Age"] >= 50]

    Name  Age
1  Tomas   51

In [38]:
str(df)
print(df)

     Name  Age
0  Anders   47
1   Tomas   51
2   Mario   41